#include <bits/stdc++.h>
using namespace std;

/*
    题目描述
    为了培养小孩的计算能力，大人们经常给小孩玩这样的游戏：从1付扑克牌中任意抽出4张扑克，要小孩用“+”、“-”、“* ”、“ /”和括号组成一个合法的表达式，并使表达式的值为24点。这种游戏就是所谓的“24点游戏”。
    请你编程求出对于给出的任意4个正整数a、b、c、d，请你编程求出这4个整数能组成多少个值为24的不同表达式。
    输入格式
    输入文件名：input.txt
    输入文件共一行，为4个正整数a、b、c、d。（0<=a,b,c,d<=100 ）
    输出格式
    输出文件名：output.txt
    输出文件为由a、b、c、d组成的值为24表达式个数，如没有，输出0
*/

int main(){
    int a, b, c, d;
    scanf("%d%d%d%d", &a, &b, &c, &d);
    int ans = 0;
    
    printf("%d", ans);
    return 0;
}
